Revit 2027 API
CurveLoop.HasPlane Method
 Identifies if the CurveLoop is planar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasPlane()
Public Function HasPlane As Boolean
public:
bool HasPlane()
member HasPlane : unit -> bool
Return Value
Boolean
 True if the curve loop is planar, false otherwise.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace